{"politics": ["http://i.imgur.com/5oEPQkm.jpg", "This is utter bovine refuse. If you actually want a leak to lose its value, do the opposite, vote against what they expect. That is if the leak really is an issue to you. Otherwise just use your better judgement, you know that small gland that got you the cushy job among the nation’s top judges.", "Worth noting that the Catholic Church, unlike the other side, had both the time and the incentive to meddle with the ancient sources we rely on. It’s not like they never changed documents before and some point out some inconsistencies in even the most important sources, it’s in the very Wikipedia articles you linked to.\n\nIt‘s the basic fallacy of trusting something to be true because it has been written down long ago. If I told you something about the life of Jesus today, without naming any sources, you would say the burden of proof was on me, but if Tacitus writes something about Jesus(who died 25 years before he even was born) without naming his sources we consider it true. We don’t even question if Tacitus **actually** wrote it or wether it was added later to lend evidence by Christians.", "Good.", "Wait a minute so Trump's brilliant legal strategy was to say they're going to arrest me and then they got too scared to arrest him I'm sorry but to be a rich white man in America", "I'm not sure why I look at these political posts on here of all places. Everyone knows 99% of Reddit users live in their mother's basement 😂", "Rubbish bunch of idiots who believe in a magic sky daddy doing exactly what the right wing put them there for.", "Oh, it's very much an [established term](https://en.wikipedia.org/wiki/Lone_wolf_attack#Stochastic_terrorism), even if it is relatively new. \n\nAnd congrats on being one of [the lucky 10 000 today](https://xkcd.com/1053/)!", "So this is a student that's enrolled in both college and high school. They'll probably graduate college early and get in the workforce sooner than their peers. What are they going to do when they feel \"uncomfortable\" in the workplace?", "&gt;Locke also wrote that there were people who wanted to “break out their witchcraft and open their Ouija boards while we celebrate,” to which he promised that **he would “walk over, pray over each of you, snatch that evil garbage out of your hands and burn it right in front of your face.”**\n\nHe'd get a beat down before he ever got close enough to the fire to toss it."], "wallstreetbets": ["absolute bloodbath in europe, financials and big oil worthless", "Troll", "SNB has no tax payer funds. \n\nAlso, they get paid for the line of credit even if not used and interest if it is.", "Many of these folks seem to take pride in losses. I don't get it either.", "Wow, it’s been a long time since I’ve seen a traditional YOLO, god be with you.", "I’ve gotten like 5 hours so far. Ran a 10k after work and knocked out after the shower. I’m under 30 but not by much 😩", "oh dang now i feel dumb is 'high' growth not a thing?", "![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|19738)", "Didn’t the real Hindenburg blow up or something?", "I just alien chest bursted through my zipper"], "relationship_advice": ["ok I see, thank you", "I think this person is making a joke. Like pointing out the absurdity of it. No, the universe doesn’t revolve around you. They will most like hardly talk about you, unless you do some weird possessive type thing, then they may have a reason to talk about you.", "Where does it say he wanted her to get an abortion? OP wrote that he stated he knew she would get an abortion. How can you contribute when you dont know your kids were even born? How can you check paternity on kids you dont know were born? He will have visitation rights when he goes to court if he chooses to go that route.  Shes had 10-15 years depending on the age of her kids to tell him and she didnt. Thats on her.", "Sadly, I know that you are not exaggerating.", "Those red flags you ignored early on are important to pay attention to; that's your intuition telling you that something is off/wrong\n\nIn future relationships, trust your intuition and don't ignore the red flags. I had to learn this the hard way too. \n\nKudos to you for refusing to continue the relationship once you found out he was married.", "OP... you're a good kid.\nI'm sorry for everything you have been through", "Is it complicated?", "This is so much to unpack really. You seem to have completely different needs and wants in live and it seems like he has troubled compromising.\n\nLike your need to have friends which you see once a week. And the rest of the time with him he feels is not worthy? I agree with him it's shitty if you dumped him for friends before that honestly can not be happening in a relationship.\n\nHow are you supposed to respark things when Everytime you try he shoots you down? \n\nAlso blocking family time because it makes you anxious to ask is bullshit.\nEither he accepts you have a fam you love or he keeps his mouth shut. \n\nIs it possible that you are bending over backwards for him while he is not taking any steps towards you to meet in the middle?\n\nHe also sounds depressed. Is he getting therapy for that?", "Try posting on r/sex. That crowd is more fine-tuned to issues like this.", "Hello /u/Tobiwan663, your request appears to ask for moral judgment or judgment on your actions. Per our [moral judgment rule](https://www.reddit.com/r/relationship_advice/comments/ivahe5/meta_autoremoving_moral_judgment_threads_also/), any requests for moral judgment (generally any yes/no questions) will result in the removal of your post even if you ask for specific advice as well.\n\nPlease remove any questions that ask for judgment of a situation (again, yes/no questions) and instead request specific advice that could not possibly result in a yes/no answer.\n\n(we may not include messages such as this on future moral judgment removals, for your awareness)\n\nThanks,\n\n-Relationship Advice mod team\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/relationship_advice) if you have any questions or concerns.*"], "amitheasshole": [" YTA.  Totally criticizing her whether you realize it or not.  Unless you are carrying her bag, why is it your concern how much she carries in it?   How would you feel if she walked behind you all day and asked you ridiculous questions?  Why do you open the door with that hand?  Why do you carry your lunch in a bag and not in a lunch box? Why do you part your hair like that? Why do you put so much toothpaste on your toothbrush?  Why do you use more than 3 squares of TP? \nYou must be the most annoying person to live with.  Unless what I am doing is some how impacting you or going get someone killed, you need to STFU.", "YTA - you lost a big chunk of time with your daughter due to your own addiction, I presume, given that you are struggling with sobriety now, and didn’t have custody of her before. \n\nYour daughter deserves to have family in her life, regardless of your own insecurities. \n\nIf you want to be held in higher regard in her life, then you need to be part of her life, and earn it. You can’t force it by removing the people who did your job for you. Refusing her access to her aunt will not endear you to her- it will just reinforce any abandonment issues she has already because of you. \n\nYou don’t say what all you are doing in regards to sobriety, but I would suggest that you look into therapy, and parenting classes.", "Yeah that makes 0 sense, I have no idea why that comment has so many upvotes. People don’t typically start doing drugs to cause any harm, and don’t intend to get addicted either, as naive as that may be.", "no...not at all.\n\nThis woman has shown zero appreciation of an amazing nanny. Being appreciated is a huge thing.\n\nShe could have her choice if jobs, parents would love a person who connects and pays attention to their child like this.\n\nThe 50 is her daughters responsibility...making it the mothers responsibility.\n\nThat 50 would be 3 or 4 hours pay...worth being upset over.", "the nanny was on holiday out west.", "YTA every point your wife brought up is valid for going with the 4 bedroom house that is not within walking distance. If your only argument is that you think she spoils her daughter then you might have to see a specialist.", "Then you punishing Ruby for Tessa's mistake. \nFor me, this mistake should be 50-50.", "I agree. Girl code can have a fair amount of grey areas, maybe the friend group thought you’d lie for your bestie. I think that’s what would be expected of girl code in this instance (though I (f) personally disagree, I wouldn’t lie for a cheater). I’m also assuming that all the people who cut you off are female? \n\nIm going go with NTA cause it was good of them to find out soon (sooner rather than later, especially if all his good friends knew but no one said anything) but in my opinion it shouldn’t have been you that told him. Maybe should have found some way to convince her to come clean? Though the outcome of people cutting you off could possibly be the same if she said it was your idea", "You're not an asshole, but you're not the brightest. Put a bit of effort in when you're meeting your partner's parents.", "Hey, if you're gonna get granular, I'm gonna get downright indigenous."], "mentalhealth": ["it could be undiagnosed thyroid problems, depression or even chronic fatigue syndrome. the latter isn't usually applicable if you didn't have the other criteria's required for a diagnosis (you can look it up). or maybe it's just a case of low iron/vitamin deficiency, etc", "Hugs", "Treating a serious problem with self-help alone is risky.\r  \n\r  \n\r  \nI have a variety of useful information here, including how to get professional help on a low budget and the self-help recommended by therapists. Treating a serious problem with self-help alone is risky but it can enhance the results of the standard treatments.\r  \nhttps://www.reddit.com/r/mentalhealth/comments/11ce3hd/depression\\_people\\_here\\_say\\_that\\_this\\_information/", "People in various countries say that they can often find the books I mention in my comments with Amazon, Kindle, or Google Books.\r  \n\r  \nThe video by Dr. Carbonell below provides first aid information.\r  \n\r  \nPeople should know that panic attacks will not harm them. These are nothing but the system's natural responses.\r  \n\r  \n\r  \nPanic disorder often responds to self-help. In fact, Handbook of Self-Help Therapies, which reviews studies of books and programs, says that of all the disorders, panic disorder is the one that’s most responsive to self-help. \r  \n\r  \nI heard someone say that although slow breathing is good for moments of panic, the attacks keep coming back. So, it looks like cognitive therapy is also helpful. Cognitive therapy for panic disorder involves understanding what the attack is. The symptoms are nothing but your system's natural responses to whatever seems threatening. You shouldn't get upset about them. You don't worry about fast heartbeat when you run, and there's no reason to fear it with a panic attack. Source - When Panic Attacks by Dr. David Burns.\r  \n\r  \nDr. Burns is the author recommended most often by mental health professionals, according to Authoritative Guide to Self-Help Resources in Mental Health.\r  \n\r  \n\r  \nYou can't go wrong with stress management. It's something we all need. This could help you with your problem.\r  \n\r  \nPsychology Today online says that Dr. Dave Carbonell is a clinical psychologist who specializes in treating fears and phobias and the author of three self-help books, including Panic Attacks Workbook.\r  \n\r  \nIn this video, Dr. Carbonell demonstrates a breathing exercise that he says is helpful for panic attacks.\r  \n\r  \nhttps://www.youtube.com/watch?v=eRIV2R3jzaQ&amp;t=49s\r  \n\r  \n\r  \nOne of the best treatments is time. You know the old saying \"Familiarity breeds contempt.\" After a while, the attacks are seen as a nuisance instead of a threat.\r  \n\r  \nI’ll tell you about two other things. \r  \n\r  \nA study by a researcher named Meuret at Southern Methodist University showed that a biofeedback method called CART that reinforces slow, shallow breathing was effective. Slow breathing is often recommended, but deep breathing tends to promote hyperventilation, making it hard for people to breathe. Many people use slow breathing self-help successfully.\r  \n\r  \nThere's a treatment called interoceptive exposure therapy. It's teaching people not to fear the symptoms of the panic attack by deliberately bringing on the symptoms - for example by bringing on a fast heartbeat by aerobic exercise.", "I'm not sating that this is all you need, and I have advice from experts about different problems like stress and anxiety in my comments.\r  \n\r  \nBut I think you'll feel a lot better when you're over the panic attacks.\r  \n\r  \nPanic disorder often responds to self-help. In fact, Handbook of Self-Help Therapies, which reviews studies of books and programs, says that of all the disorders, panic disorder is the one that’s most responsive to self-help. \r  \n\r  \nI heard someone say that although slow breathing is good for moments of panic, the attacks keep coming back. So, it looks like cognitive therapy is also helpful. Cognitive therapy for panic disorder involves understanding what the attack is. The symptoms are nothing but your system's natural responses to whatever seems threatening. You shouldn't get upset about them. You don't worry about fast heartbeat when you run, and there's no reason to fear it with a panic attack. Source - When Panic Attacks by Dr. David Burns.\r  \n\r  \nDr. Burns is the author recommended most often by mental health professionals, according to Authoritative Guide to Self-Help Resources in Mental Health.\r  \n\r  \n\r  \nYou can't go wrong with stress management. It's something we all need. This could help you with your problem.\r  \n\r  \nPsychology Today online says that Dr. Dave Carbonell is a clinical psychologist who specializes in treating fears and phobias and the author of three self-help books, including Panic Attacks Workbook.\r  \n\r  \nIn this video, Dr. Carbonell demonstrates a breathing exercise that he says is helpful for panic attacks.\r  \n\r  \nhttps://www.youtube.com/watch?v=eRIV2R3jzaQ&amp;t=49s\r  \n\r  \n\r  \nOne of the best treatments is time. You know the old saying \"Familiarity breeds contempt.\" After a while, the attacks are seen as a nuisance instead of a threat.\r  \n\r  \nI’ll tell you about two other things that you probably won’t need. It’s good to know they’re there if you need them.\r  \n\r  \nA study by a researcher named Meuret at Southern Methodist University showed that a biofeedback method called CART that reinforces slow, shallow breathing was effective. Slow breathing is often recommended, but deep breathing tends to promote hyperventilation, making it hard for people to breathe. Many people use slow breathing self-help successfully.\r  \n\r  \nThere's a treatment called interoceptive exposure therapy. It's teaching people not to fear the symptoms of the panic attack by deliberately bringing on the symptoms - for example by bringing on a fast heartbeat by aerobic exercise.", "People here say that it's best to taper off instead of doing cold turkey.\r  \n\r  \nOne problem with quitting if you've been a daily user is that you have lots of time on you hands that you used for being high. Many experts recommend activities that get your mind involved, like an interesting hobby. I know of a recovering addict who learned to play the guitar.\r  \n\r  \nA problem with hobbies is that learning skills can be frustrating. Author Josh Kaufman has some really good ideas about this -\r  \n\r  \nhttps://www.youtube.com/watch?v=5MgBikgcWnY&amp;t=966s\r  \n\r  \nSmokers often say that weed helps them to appreciate all the nice little things of daily life - good music, a good dinner, relaxing after dinner.\r  \n\r  \nYou don't need a drug to enjoy those things.\r  \n\r  \nA Yale medical journal says that the best things for avoiding relapse from addiction are relaxation with traditional Asian methods and cognitive therapy.\r  \n\r  \nThe Asian method with the best evidence is slow breathing. Two psychiatrists, Brown and Gerbarg, say a 10 or 20 min slow breathing exercise is good and 20 min twice a day is a therapy for anxiety. The exercise is inhale and exhale gently, 6 seconds each.\r  \n\r  \nMore info, including the 3-part mind-body program of Brown and Gerbarg, here -\r  \n\r  \nhttps://www.youtube.com/watch?v=wqEM\\_jlDRZI\r  \nThis video shows you how easy it is to get started with meditation -\r  \nhttps://www.youtube.com/watch?v=4d9xFfA6F50&amp;t=88s\r  \n\r  \n\r  \nCognitive therapy - SMARTRecovery.org is like a brainy version of NA, ex-users who believe in psychology. They have a program based on the most popular counseling methods.", "What I usually tell people who have a problem with money -\r  \n1) Your GP may be helpful, perhaps in directing your search, helping you with your priorities, or giving you a prescription. You might get help at Mark Cuban's affordable drug company online. This  company is getting a lot of attention lately. Some are saying that it can radically change the drug industry.\r  \n2) There's a variety of things that can help - low-cost, low-risk things that are easy and can be combined with each other. I have advice from experts in my comments. \r  \n\r  \n\r  \n https://www.reddit.com/r/mentalhealth/comments/o52kin/tips\\_on\\_how\\_to\\_cope/\r  \n\r  \n\r  \nVideo, below - details about self-help based on cognitive-behavioral therapy and lifestyle choices that help with depression - nutrition, basic lifestyle things like sleep, exercise, and social support, also traditional Asian methods.\r  \nhttps://www.youtube.com/watch?v=wqEM\\_jlDRZI\r  \n\r  \n\r  \n\r  \n3) Do research, including study of the online therapy reviews. Healthline, a site I rely on for good information, has an article that rates online services.\r  \n\r  \nDo what you can to get a therapist. You may have to do a lot of research about this. Don't give up. Call your local social services (211?) and ask about Medicaid and Obamacare. Also, you can google \"affordable psychotherapy.\" The cost of therapy can vary a lot. \r  \n\r  \nhttps://www.healthinsurance.org/obamacare/how-obamacare-improved-mental-health-coverage/\r  \n\r  \nhttps://careforyourmind.org/what-to-do-when-you-cant-afford-therapy/\r  \n\r  \nYou can try your local designated mental health agency. They typically have psychiatric prescribers and tend to take a wide array of insurance.", "One of the worst things about depression is the way it breaks up friendships.\r  \n\r  \nI don't know what happened with you and your friend. I'll just say, from experience, that when people are depressed they sometimes hope that their friends will be like therapists, and it doesn't work. Friends don't know what to say, or they say the wrong things.\r  \n\r  \nI have a variety of useful information here, including how to get professional help on a low budget and the self-help recommended by therapists. Treating a serious problem with self-help alone is risky but it can enhance the results of the standard treatments.\r  \n\r  \nhttps://www.reddit.com/r/mentalhealth/comments/11ce3hd/depression\\_people\\_here\\_say\\_that\\_this\\_information/", "People your age have said that this advice helps -\n\nWith depression, there's what seems like a Catch 22. People say, \"I know there are things that will make me feel better - getting exercise, taking care of myself, straightening up the house and cleaning, but I'm depressed and I don't have the energy.”\r  \n\r  \nHere's the thing - very important. People do have energy when they're depressed - as much energy as they always do, but for some reason, the system is reluctant to let you use your energy.\r  \n\r  \nWe have to use psychology to coax energy out of our systems. Psychology has some nifty tricks.\r  \n\r  \nA famous psychiatrist, Abraham Low, said that when we can't control our feelings we can still control our muscles. If you tell your arms and legs to get you our of bed or to the bathroom for a shower, they will obey.\r  \n\r  \nTry this when it seems that you're too tired to work. Lie on the couch, close your eyes, and get ready to work by imagining yourself working for 5 minutes.\r  \n\r  \nThis is a motivation trick that's been used in behavior modification programs since the 1930s. If a task seems like it's too big, think of it as a series of tasks that you can take on one at a time, and start with something really, really easy. Cleaning - start by cleaning for 3 or 4 min and take a 5 min break. Homework - start by proofreading a paper or previewing a chapter you're going to read by looking at headings, sub-headings, etc.\r  \n\r  \nYou don't have to be an athlete to benefit from exercise. As little as 20 min brisk walking a day can help, and you can add to that gradually so long as you don't make yourself sick of exercise with too much and quit. Steve Ilardi, the therapist/researcher who headed the lifestyle-depression project at the Univ of Kansas, talks about enjoyable ways to get exercise.\r  \n\r  \nIf you go to Metapsychology, you can read a psychologist's review of Dr Ilardi's book (\"splendid\").\r  \n\r  \nOf all the traditional mind-body practices (meditation, etc.), the one with the best evidence for affecting mood disorders is slow breathing. It’s used for treating anxiety, depression, panic disorder, and PTSD. It's safe and it doesn't take any training.\r  \n\r  \nVideo, below - details about self-help based on cognitive-behavioral therapy and lifestyle choices that help with depression - nutrition, basic lifestyle things like sleep, exercise, and social support, also traditional Asian methods.\r  \n\r  \nIt has advice specifically for depressed students, such as StudentsAgainstDepression.org.\r  \n\r  \nhttps://www.youtube.com/watch?v=wqEM\\_jlDRZI\r  \n\r  \nAlways remember that there are people you can talk to, like a school counselor.\r  \n\r  \nMy comments have good info for coping in a crisis, including the NIMH hotline.", "Depression is like a pair of glasses that make everything look worse. When you recover, things will seem different. Problems that seemed hopeless will suddenly have obvious solutions.\r  \n\r  \n\r  \n**A lot of things can help, mostly things that are easy. My recent comments have advice from experts about standard treatments and the self-help recommended by therapists. Feel free to click on my name and read.**\r  \n\r  \n\r  \nhttps://www.reddit.com/r/mentalhealth/comments/11ce3hd/depression\\_people\\_here\\_say\\_that\\_this\\_information/\r  \n\r  \n\rThe most important thing is knowing how to cope in a moment of crisis. It's very important to calm down. This will make you feel better and let you think clearly. A very easy way to calm down is just to breathe slowly. Dialectical Behavior Therapy, which helps people who have BPD, recommends this - breathe gently, hand on your belly to feel it go in and out, and breathe 5 seconds in-breath and 7 seconds out-breath till you feel OK.\r  \n\r  \n\r  \nSimple distractions can help. The video below shows you distractions that can calm you down, also a safe hotline. No one will bother you if you call.\r  \nhttps://www.youtube.com/watch?v=1yBXl81QPyY&amp;t=7s"], "COVID19": ["[twitter.com] is not a scientific source. Please use sources according to [Rule 2](https://www.reddit.com/r/COVID19/about/rules/) instead. Thanks for keeping /r/COVID19 evidence-based!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/COVID19) if you have any questions or concerns.*", "I don't believe in Dr. Fauci, I believe in science.", "&gt; Sorry about that\n\nNo, you aren't.", "Please continue to believe in Dr. Fauci as you wish.", "Dr. Redfield also said that US agencies had likely funded virus gain of function research at the Wuhan institute.\n\nLook, this whole legislation is yet another inflammatory political stunt conjured up to paint the congressman as a “people’s champion”. \n\nIt knowingly omitted parts of the testimony that could question the doctor’s impartiality and parts that could paint American government in a negative manner.\n\nNot saying that the Wuhan origin theory is entirely impossible, but you need hella lot more than just a guy’s hypothesis to start pointing fingers.", "NOT SCIENCE!!!!!", "Another post spamming this junk press release with zero science or proof in it?  What is going on...\n\nEDIT: And it now makes sense.  You're a spammer for chinese billionaire Guo Wengui, the fraudster that was just arrested and charged with 12 crimes and was working closely with Steve Bannon to overthrow the 2020 US election and spread covid conspiracy theories.  Absolute garbage.", "Looking at your profile it's clear all you do is spam junk.  This link is to a congressman's press release with zero science or proof in it.  Just because Dr. Redfield \"believes\" it is a lab leak doesn't make it so.  We just don't know.\n\nEDIT: And it now makes sense. You're a spammer for chinese billionaire Guo Wengui, the fraudster that was just arrested and charged with 12 crimes and was working closely with Steve Bannon to overthrow the 2020 US election and spread covid conspiracy theories. Absolute garbage.", "This post is NOT science!!!!!!", "Your comment has been removed because\n\n* **Off topic and political discussion is not allowed.** This subreddit is intended for discussing science around the virus and outbreak. Political discussion is better suited for a subreddit such as /r/worldnews or /r/politics.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/COVID19) if you have any questions or concerns.*"], "personalfinance": ["If this is money you are going to need access to in the next 9 months, HYSA. I keep my EF in a HYSA since it’s the most liquid if I needed it right away. CDs can offer a better rate but your locking it for the term. Ally does offer a no penalty CD right now at 4.75% which is pretty good as well.", "This submission has been temporarily locked for review due to a high volume of rule-breaking comments. Thank you in advance for your patience as we try to maintain a high-quality discussion. The original submission text is below.\n\n---\n\nGot a friend working for new company, they are hiring and said friend recommended me. \nThey contacted me and offered me a 25% jump for the same position and role as my current company. They sent me an offer which I didn’t technically accept yet but demonstrated that I was very willing during chats with project manager.\n\nWent to current employer which I have been for almost 3 years. My manager said he has big plans for the future and I was going to be one of the selected people to spearhead this when the time comes. Had a meeting with him and HR and they offered me a raise that would match those 25% but progressively over next 4 months, since it wouldn’t be a promotion per se and there are other people in my role that could potentially hold a grudge.\n\nNot sure what to do. New company I’d be a random new guy making good money but same title, so chances of going up the ladder soon would be gone. It would be a nice fresh start.\nHowever If I stay with current company, I’d be making use of that 3 year relationship to get a better role/promotion, probably by the end of the year, which long term seems more valuable, even though I’d be making less in the immediate term.\n\nI am also worried that due to uncertain world economics, in case of problems, as the new hire in a new company, I’d be one of the first to be let go\n\nHow do I figure this out?", "For some industries, employers might reference a credit report, but not so much in software.\n\nIn many states, your credit record can also figure into your insurance rates, but California is one of the states that bans this practice.\n\nLandlords tend to lean heavily on a credit report and I'm surprised that your apartment hasn't ever checked. I think this could potentially become an issue in the future. \n\nThe other angle is that life sometimes throws curveballs. If you get a job offer in another state that's too good to turn down. Maybe you unexpectedly end up somewhere where the credit record matters more", "If you want to keep it as cash, bank account bonuses or T-bills are good options.\n\nBut that’s a *lot* of cash to be holding on to unless you’ve got a plan for it in the medium term.", "If you want to take your current employer's counter offer, make sure that they give you a severance package in the agreement.  You want to make it hurt for them to try and find a replacement and fire you.", "How active do you want to be? Set and forget just use an HYSA. You can do money market as well there are plenty.\n\nIf you want to set and forget and also know exactly when you need the money there are plenty of CDs. People downvote every mention of them but like all financial instruments they are a tool. \n\nIf you want to be more active but safe you can do short term treasuries or again CDs (3 mo. Rates are very good right now), do some laddering so you always have say earnest deposit money coming available.\n\nI'm not a fortuneteller but not sure I see the short term risk/reward upside in bond funds compared to just buying short term treasuries and holding them to maturity, but maybe some bond trading experts have different opinions.", "I don't use to be this kind of behavior when i'm already working. Just want to be nice, and not feel full of myself. I will just choose the best that benefit is mean the most", "People are telling you to wait because they think the stock market is going to continue going down.  \"Buy Low, sell High.\"  The counter to that is people do a poor job deciding when a security is low or a security is high.\n\nA lot of people maintain that dollar-cost-averaging (DCA) is a good way to invest periodically.  Some people assert that since we can't know what's low or high, that statistically DCA provides superior results.\n\nPersonally, I find that I do better in the market if I have a rule / formula / algorithm behind the decision I make.  Having a rule takes the emotion out.\n\nThere are 4 basic places you can put money:\n\n* in a tax-advantaged investment account\n* in a taxable investment account\n* in a bank account\n* under your mattress.\n\nI think all 4 are important.  \n\nThe idea behind an emergency fund is to keep the money accessible and \"safe\" from investment losses.  That fund is there to cover unexpected expenses, so you don't want to sell some of your Apple stock at a loss to cover an unexpected expense.\n\nThe idea behind 401k and IRAs is to save money for retirement.  Those accounts are tax advantaged.  A 529 is also tax advantaged, but it's for educational expenses.\n\nA taxable investment account is someplace to put money that you might want to spend in the distant future, but before you're eligible for retirement.  Maybe a big vacation trip.  Or a new car.\n\nSo....  I think you're being lazy on saving for retirement, and you need to step up and put more in.  I'd go two-fold:\n\n1.  I'd max out how much wifey puts into her IRA every year.  The limit for 2022 is 6k, and you've got almost a month to put that 6k in for 2022.  The limit for 2023 is 6.5k.\n2. I'd contribute more to your 401k.\n3. In total, I'd target saving 10 - 15 percent of your combined income to your combined retirement accounts.\n\nLooking at investments daily or monthly is only going to convince you that investments are bad.  On average the stock market grows at 10% per year...but some years it drops 20%.  2022 was one of those years.  BUT...  if you compare the NAV of your 401k funds to what it was 5 years ago...  I bet it's up considerably...even with the drop last year.\n\nJust remember what you're doing when you buy a mutual fund...  you're buying ***shares*** of a mutual fund.  As the value of a share goes up, the value of your account goes up.  If you're investing $100 a month in the fund, when it's down you're buying more shares...your $100 goes a little further.", "Lol seriously. I have no idea how that trope is so widespread on reddit. \n\nThese people are thinking they're so much more important than they actually are. As someone mid-level management in Manufacturing, I don't really care what your pay ends up. I just want to get this issue resolved so that I can move on to the next fire that I have to deal with.", "Not even that, just leave already. What if you got in writing and it doesn't happen? Would OP start suing the manager? the company? Nonsense, the best option is to move on."], "aww": ["Please throw the toy.\n\nThrow the toy, come on.\n\nMom! It doesn't throw the toy.", "Until they bite you on the arse for more biscuits. Nara Japan.", "AI chimera kitty, or AI Frankenkitty", "For one second I saw a shredded face incoming.", "Tongue go Mlep", "Hello, u/AfkBee!  We thank you for your post, however:\n\n* It has been removed, but here's what you can do to fix it!\n\n* We require all new users (those with &lt; 3,000 comment karma which you can find here:  http://old.reddit.com/user/AfkBee/overview) to post OC and not reposts.  \n\n* **If this post is content that you took with your own camera**, then please delete and resubmit with either \"[OC]\" or \"(OC)\" in the title.  \n\n* If it is not your own Original Content, then please participate by commenting first to increase your comment karma.\n\nThis is a spam prevention measure; thank you for understanding.  Please note that putting OC on a post that isn't yours is against the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/aww) if you have any questions or concerns.*", "That is so fricking cute", "He’s a service animal as well. Very docile, good boy. I love him a lot. 15 years I’ve had him..", "Looks like you ripped it out of minecraft lol", "Bro said &gt;:{"], "gardening": ["Yes, I think I have me a job for life, uprooting mint. 🤣 Unpaid unfortunately and only short-term results, but lots of time spent in fresh air listening to birds singing and bees humming. It’s not all bad. 👍", "Poor shrinking violet. Now she's called a weed.", "Respect, I hadn't thought of her.. 🙏🤟🍀", "The Crimson tomato was rediscovered by MIgardener.   \n\n\n85 year old seeds, sprouted and are now being shared with the public again.   \nIts neat how often we lose seed lines.", "Pictures taken from an iPhone?", "Confirmed am spooked", "If you have found moth larvae in your raised beds, there are several steps you can take to get rid of them. First, remove any visible larvae or pupae by hand or with a tool and dispose of them in a sealed container. Then, turn the soil over in your raised beds to expose any hidden larvae. You can also use natural insecticides like neem oil or Bacillus thuringiensis (BT) and encourage natural predators like birds and beneficial insects to visit your garden. Additionally, practice good garden hygiene by removing dead plant material and consider using row covers or netting to protect your crops. By following these steps, you can help keep moth larvae under control and protect your garden from damage. [https://www.mothprevention.com/blogs/the-art-of-prevention/how-to-get-rid-of-moth-larvae](https://www.mothprevention.com/blogs/the-art-of-prevention/how-to-get-rid-of-moth-larvae)", "MEOW!", "😳 Here I am thinking 16 tomato plants was a lot for me. Amazing!", "Thanos ain't got shit on gardeners."], "travel": ["In my experience with EasyJet you can usually take a whole extra (small) bag on alongside your regular carry on – if you’ve bought something from duty-free for example. If be surprised if they didn’t let you take a small pillow.", "That's awesome. I'm headed to Coron next month, and will probably swing back over and see El Nido the following month. The obligatory picture with the San Mig Light was funny. I've taken a few of those myself. Thanks for sharing these and I look forward to your full \"report\".", "Yeah! Sure! Go right ahead! There aren’t protests or riots going in Paris right now or anything.", "Thank you so much, this is the information I needed and couldn’t find anywhere!", "Your passport has your address? What happens if you move? Put your actual current address.", "Agreed. I mostly use my credit or debit card in Gouna with no issue and better exchange rate", "I’m a white male which probably explains it and I was bracing myself for a week in Cairo and a couple of other places. Absolutely no issues at all, we weren’t hassled once. \n\nThe place need a good wash in an ideal world but venturing into the white desert was one of the bat things I’ve ever done.", "oh no no, like an actual cushion.. not a massive one, roughly a 45cm??", "You mean the kind you put around your neck? A travel pillow?\n\nIf so,no problems... just put it around your neck and 'wear' it when you board.I often see people doing that.", "The people sucked in Cairo, but the sights are beyond comparison and other cities were friendlier. Overall, it's definitely worth it."]}